{
  "teamMembers": [
    {
      "name": "Andrew Wafaa",
      "title": "Arm",
      "company": "Arm",
      "image": "/assets/images/content/WafaaProfile.jpg",
      "bio": "Andrew Wafaa leads Arm’s Open Source Office, encompassing internal and external open source engagements. He joined the company in 2012 and has held various roles covering both technical and marketing fields. Prior to Arm he was a Solutions Architect at Fujitsu UK, having served at EMC prior to that. With nearly 20 years of experience in the Open Source space, he has held and continues to hold numerous Board positions in various projects. Prior to the technology world, Andrew spent over a decade in the aviation space and is slowly returning to it as a private pilot.",
      "teams": [
        "technical_steering_committee"
      ]
    },
    {
      "name": "James King",
      "title": "Arm",
      "company": "Arm",
      "image": "/assets/images/people/JamesKing.png",
      "bio": "James King leads the open source system software architecture group at Arm. He joined Arm in 2014 and has filled various roles leading and developing example software stacks and solutions across all the ecosystems that Arm supports. Before that he was part of the Software Architecture team in Broadcom’s Mobile division; Led platform software for the 2/3G modem at Samsung; Developed management software for servers at Sun Microsystems; and developed network software at Madge Networks. None of his work has been in any way related to the PhD in High Energy Physics he gained at CERN before becoming a software engineer.\n",
      "teams": [
        "technical_steering_committee"
      ]
    },
    {
      "name": "Todd Kjos",
      "title": "Board member for Google",
      "company": "Google",
      "order": "7",
      "image": "/assets/images/people/ToddKjos.jpg",
      "bio": "Todd Kjos is a technical lead for the Android Kernel Team at Google. He maintains AOSP common kernels and is a Linux maintainer for the binder driver. He also leads the development of Android kernel scheduling and DVFS. Previously he worked on x86 and Itanium server enablement and Itanium virtualization.\n",
      "teams": [
        "technical_steering_committee",
        "board_of_directors"
      ]
    },
    {
      "name": "Azzedine Touzni ",
      "title": "Qualcomm",
      "company": "Qualcomm",
      "image": "",
      "bio": "",
      "teams": [
        "technical_steering_committee"
      ]
    },
    {
      "name": "Trilok Soni",
      "title": "Qualcomm",
      "company": "Qualcomm",
      "teams": [
        "technical_steering_committee"
      ]
    },
    {
      "name": "Kiyoshi Owada",
      "title": "Socionext",
      "company": "Socionext",
      "teams": [
        "technical_steering_committee"
      ]
    },
    {
      "name": "Eric Finco",
      "title": "STMicroelectronics",
      "company": "STMicroelectronics",
      "image": "/assets/images/people/Eric-Finco.jpg",
      "bio": "Eric Finco is Senior Engineering Director at ST-Microelectronics heading up Linux kernel development as well as hardware/software applications for digital consumer products. He has almost 25 years experience in telecom and embedded software and systems at Philips, NXP, ST-Ericsson and ST-Microelectronics and has worked for 18 years in the Arm software and hardware ecosystem. Eric graduated from Paris XI- Orsay University and the Grenoble Institute of Technology (INPG) in France.\n",
      "teams": [
        "technical_steering_committee"
      ]
    },
    {
      "name": "Li Gong",
      "title": "Chief Executive Officer at Linaro",
      "company": "Linaro",
      "order": "1",
      "image": "/assets/images/people/LiGong.jpg",
      "bio": "Li is a globally experienced technologist and executive, with deep background in computer science, research and product development, and open source technologies. He has worked in senior leadership roles extensively in the US and in Asia, having served as President and COO at Mozilla Corporation, General Manager at Microsoft, as well as Distinguished Engineer at Sun Microsystems and Distinguished Scientist at SRI International. \n He graduated from Tsinghua University, Beijing, and received a PhD from University of Cambridge. In 1994 he received the Leonard G. Abraham Prize given by the IEEE Communications Society for “the most significant contribution to technical literature in the field of interest of the IEEE.”\n",
      "teams": [
        "technical_steering_committee",
        "executive_team",
        "board_of_directors"
      ]
    },
    {
      "name": "Rob Booth",
      "title": "Chief Operating Officer at Linaro",
      "company": "Linaro",
      "order": "2",
      "image": "/assets/images/people/Rob-Booth-72dpi1.jpg",
      "bio": "Rob has a wealth of operational, commercial and financial experience gained in the Technology and Life Science sectors, in the UK and internationally, in environments characterized by rapid growth and change. He has a healthy mix of blue-chip multinational discipline, from holding senior positions in SmithKline, General Electric and Pharmacia, and entrepreneurial flexibility and resourcefulness gained from his experience as CEO and CFO of several Cambridge UK start-ups, which included taking Tadpole Technology plc public and being a joint-founder of Synomics, a Bioinformatics software engineering company. Rob is passionate about helping build companies, generating maximum value from scarce resources and mentoring.\n",
      "teams": [
        "executive_team",
        "board_of_directors"
      ]
    },
    {
      "name": "Joe Bates",
      "title": "General Manager and VP of Member Services at Linaro",
      "company": "Linaro",
      "image": "/assets/images/content/joe_bates_new.jpg",
      "bio": "As EVP of Member Services Joe is responsible for the success of Linaro’s members, overseeing Linaro’s support and services strategy and operations including the direct management of all Linaro member services functions, engagements and Landing Teams.Joe has over 20 years of experience and a hands-on style building and leading exceptional services, support and sales teams that insure customer success and consistently deliver business results at leading technology companies such as Progress Software, BEA Systems, Onesource Information, Object Design and SavaJe Technologies. Joe resides with his family in the Boston area.\n",
      "teams": [
        "executive_team"
      ]
    },
    {
      "name": "Andrea Gallo",
      "title": "VP of Business Development at Linaro",
      "company": "Linaro",
      "image": "/assets/images/content/a-gallo-linaro.jpg",
      "bio": "Andrea joined the Linaro Technical Steering Committee in 2010 as an ST-Ericsson Fellow before becoming a Linaro employee in 2012 as the Director of the Linaro Enterprise Group (now known as the Linaro Data Center and Cloud Group). He then went on to work as the VP of Segment Groups and Strategic Initiatives before taking on his current VP of Business Development role. Prior to Linaro, Andrea worked at STMicroelectronics, leading the development of the world’s first USB ADSL soft-modem with WHCL certification. He also set up ST Linux teams in Noida and Bangalore for the smartphone application processors division. Andrea holds a University Degree in Telecommunication and speaks fluent French and English, in addition to his native Italian.\n",
      "teams": [
        "executive_team"
      ]
    },
    {
      "teams": [
        "executive_team",
        "technical_steering_committee"
      ],
      "name": "Tim Benton",
      "title": "VP of Engineering",
      "company": "Linaro",
      "image": "/assets/images/content/img_8808.jpeg",
      "bio": "Tim has over 30 years experience in Software Engineering in a variety of roles and companies, with phone and embedded being a strong theme throughout. After university, Tim worked in several startups before picking one (STNC) that was bought by Microsoft, where he spent 12 years in both the UK and US, leading teams and working closely with OEM and Mobile Operator partners to bring up and ship new hardware. After a stint in consulting building IoT solutions and helping companies turn around their engineering teams, Tim moved to Arm in 2017 where, as Senior Director of the Open Source Software Group, he was responsible for the 250 engineers in that team, and worked closely with Linaro on various projects and as a committee member. In 2020 Tim led several teams at Facebook tackling some of the key platform initiatives in the integrity space. Tim has a keen interest in how to manage teams and build software efficiently - and how different companies achieve this. "
    },
    {
      "name": "Mark Hambleton",
      "title": "Board member for Arm and Chairman",
      "company": "Arm",
      "order": "3",
      "image": "/assets/images/people/MarkHambleton.jpg",
      "bio": "Mark Hambleton is vice president of Open Source Software at ARM. Mark joined ARM in 2014 and took over leading the open source software group soon after. Within this role, Mark leads the system software teams chartered with driving Arm’s leadership in open source and has been responsible for the software engineering relationship with Linaro. Prior to joining Arm, Mark was a member of the Linaro TSC representing Broadcom and prior to Broadcom was the Head of Core Systems and a Distinguished Architect at Nokia in their Smart Devices group.Mark has been working with open source technologies for approaching 20 years and in the Arm ecosystem for more than 10, and involved with Linaro at various levels for over 5 years.",
      "teams": [
        "board_of_directors"
      ]
    },
    {
      "name": "Jonathan Cameron",
      "title": "Board member for HiSilicon",
      "company": "HiSilicon",
      "order": "4",
      "image": "/assets/images/people/jonathan-cameron.jpg",
      "bio": "Jonathan leads the ARM server kernel team at Huawei Technologies Research & Development (UK) Ltd. based in Cambridge, UK.  The UK team works alongside ARM64 Solutions within HiSilicon, to provide upstream kernel support for Kunpeng server SoCs.  A recent personal focus has been on CCIX, taking an active role in the CCIX Consortium's TSC, SW and Protocol working groups.\nJonathan has a PhD in Information Engineering from Cambridge University. It was there, during a Post Doc on wireless sensor platforms, that he first encountered the upstream kernel and he subsequently developed the IIO kernel subsystem which he has now maintained for 10+ years. He takes a particular interest in encouraging new contributors to the upstream kernel.",
      "teams": [
        "board_of_directors"
      ]
    },
    {
      "name": "Sandeep Singhai",
      "title": "Board member for Qualcomm",
      "company": "Qualcomm",
      "order": "5",
      "image": "/assets/images/people/SandeepSinghai.jpg",
      "bio": "Sandeep Singhai is Senior Director of Engineering at Qualcomm Innovation Center where he has held various leadership positions in the area of power and performance on mobile SoCs, IoT, project engineering, large scale software management and product commercialization. He current leads the Linux and Android HLOS engineering team responsible for delivering vertically integrated software solutions across Qualcomm’s Snapdragon chipsets, commercialized on over billion mobile devices. Sandeep has more than 20 years of experience in the wireless and IoT industry and he holds 10 patents in the area of data communications, broadcast systems and multimedia. He has a Master of Technology in Computer Science and Engineering from Indian Institute of Technology, Kanpur.",
      "teams": [
        "board_of_directors"
      ]
    },
    {
      "teams": [
        "executive_team",
        "technical_steering_committee"
      ],
      "name": "Grant Likely",
      "title": "Chief Technical Officer at Linaro",
      "company": "Linaro",
      "image": "/assets/images/content/img_2696-1-.jpg",
      "bio": "Prior to his role as Linaro's CTO, Grant was the senior technical director in the architecture group at Arm. This involved responsibility for the SystemReady IR program which brings interoperability between hardware, operating systems and applications to the edge and IoT ecosystems. Prior to Arm Grant was a Linaro Fellow in the CTO office and helped shape Linaro’s overall technical strategy when it was formed in a way that supports the different strategic goals of each Linaro group. Grant is well known in the Linux kernel development community as the previous Devicetree maintainer and as a community leader who chaired the Linux Foundation Technical Advisory Board, has helped organize conferences, and is a frequent speaker at conferences. It is through his Linux work that he saw the power of collaboration to achieve far more than any of us can individually. Working on Linux inspired him in 2005 to start a consulting business focused on helping clients build simpler and maintainable embedded Linux devices by collaborating with the developer community rather than taking from it. In each role since he has continued to seek greater collaboration and take advantage of opportunities for shared engineering."
    }
  ]
}